tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/cask-fonts"


# Homebrew can manage 3 kind of apps
# 'brew' will be used for CLI software
# 'mas' will be used for Mac App Store software
# 'cask' will be used for all the apps not available on the app store

brew "mas"

## personal
brew 'docker-compose'
brew 'fd' # find alternative
brew 'neovim'
brew 'plantuml'
brew 'ripgrep' # grep alternative
brew 'volta'
brew 'yarn'
brew 'zsh-autosuggestions'

## work
brew 'awscli'


# Mac App Store apps
## Personal
mas "1Password for Safari", id: 1569813296
mas "Audio Diary - AI Voice Journal", id: 6444500487
mas "Dark Noise: Ambient Sounds", id: 1465439395
mas "SnippetsLab", id: 1006087419
mas "The Unarchiver", id: 425424353
mas "Things 3", id: 904280696
mas "ToothFairy", id: 1191449274
mas "Velja", id: 1607635845
mas "Vimari", id: 1480933944


# Other apps
## Personal
cask '1password'
cask '1password-cli'
cask 'appcleaner'
cask 'arc' # arc-browser
cask 'bartender'
cask 'beeper'
cask 'bruno'
cask 'datagrip'
cask 'docker'
cask 'elgato-wave-link'
cask 'fantastical'
cask 'fork'
cask 'google-chrome'
cask 'hyperkey'
cask 'jetbrains-toolbox'
cask 'notion'
cask 'proxyman'
cask 'raycast'
cask 'replacicon'
cask 'screens' # current version is 4.12.16
cask 'setapp'
cask 'spotify'
cask 'visual-studio-code'
cask 'warp'
cask 'webstorm'

## Work
cask 'slack'

# Fonts
cask 'font-anonymous-pro'


